scripts/devvpc/k8s/wso2/SOCN.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:SORequest xmlns:ns2="http://www.usda.gov/gsa/nsfs/ws/OrderServices/SO/">
            <header>
                <data_transaction_sequence_num>79471072022067524373</data_transaction_sequence_num>
                <data_transaction_code>SO</data_transaction_code>
                <data_transaction_file_date>2019-04-05Z</data_transaction_file_date>
                <contract_number>GS00Q17NSD3009</contract_number>
                <order_header_type_code>I</order_header_type_code>
                <conexus_purchase_order_number>41111779</conexus_purchase_order_number>
                <order_fragment_number>1</order_fragment_number>
                <total_order_fragments>1</total_order_fragments>
                <contractor_invoice_level_account_number>SF000145</contractor_invoice_level_account_number>
                <agency_task_order_num>TKNUM1001</agency_task_order_num>
                <agency_task_order_modification_number>0</agency_task_order_modification_number>
                <agency_order_sent_date>2019-04-05Z</agency_order_sent_date>
                <early_installation_code>N</early_installation_code>
                <contracting_officer_representative_email_address>MANJULA.MUTHYALA@OCIO.USDA.GOV</contracting_officer_representative_email_address>
                <order_point_of_contact_email_address>TEST@TEST.COM</order_point_of_contact_email_address>
                <order_point_of_contact_first_name>TEST</order_point_of_contact_first_name>
                <order_point_of_contact_last_name>TEST</order_point_of_contact_last_name>
                <order_point_of_contact_work_phone_number>2345678901</order_point_of_contact_work_phone_number>
            </header>
            <body>
                <agency_service_request_number_2>GSAOID-41111787:41111787</agency_service_request_number_2>
                <package_id>7490b5b3-4da8-484e-8f95-c12cf3c2edb9</package_id>
                <body_id>41111787</body_id>
                <agency_hierarchy_code>335288116ANYR2Q3DAQIEHHBGZ1P</agency_hierarchy_code>
                <contract_line_item_number>WL00012</contract_line_item_number>
                <clin_description>5 GB Data Add-on Pooling</clin_description>
                <order_item_type_code>I</order_item_type_code>
                <quantity>1</quantity>
                <fully_loaded_price_code>N</fully_loaded_price_code>
                <charging_frequency_and_sre_element_code>MRC</charging_frequency_and_sre_element_code>
                <iconectiv_nsc>FTCLCOVS</iconectiv_nsc>
                <location_country>Domestic: CONUS</location_country>
                <street_number>2150</street_number>
                <street_name>Centre</street_name>
                <street_type>Ave</street_type>
                <location_city>Fort Collins</location_city>
                <location_state>CO</location_state>
                <location_postal_code>80526</location_postal_code>
                <location_latitude>40.558777</location_latitude>
                <location_longitude>-105.08703</location_longitude>
                <building>BULD B</building>
                <floor>FLR F</floor>
                <site_special_instructions>LOCATION NOTES</site_special_instructions>
                <existing_access_code>N</existing_access_code>
                <access_diversity>F</access_diversity>
                <access_path_avoidance>F</access_path_avoidance>
                <originating_jurisdiction_code>120033</originating_jurisdiction_code>
            </body>
            <body>
                <agency_service_request_number_2>GSAOID-41111788:41111788</agency_service_request_number_2>
                <package_id>7490b5b3-4da8-484e-8f95-c12cf3c2edb9</package_id>
                <body_id>41111788</body_id>
                <parent_body_id>41111787</parent_body_id>
                <agency_hierarchy_code>335288116ANYR2Q3DAQIEHHBGZ1P</agency_hierarchy_code>
                <contract_line_item_number>WL00020</contract_line_item_number>
                <clin_description>Pooling Overage for Data Add-on</clin_description>
                <order_item_type_code>I</order_item_type_code>
                <quantity>1</quantity>
                <fully_loaded_price_code>N</fully_loaded_price_code>
                <charging_frequency_and_sre_element_code>USAGE</charging_frequency_and_sre_element_code>
                <iconectiv_nsc>FTCLCOVS</iconectiv_nsc>
                <location_country>Domestic: CONUS</location_country>
                <street_number>2150</street_number>
                <street_name>Centre</street_name>
                <street_type>Ave</street_type>
                <location_city>Fort Collins</location_city>
                <location_state>CO</location_state>
                <location_postal_code>80526</location_postal_code>
                <location_latitude>40.558777</location_latitude>
                <location_longitude>-105.08703</location_longitude>
                <building>BULD B</building>
                <floor>FLR F</floor>
                <site_special_instructions>LOCATION NOTES</site_special_instructions>
                <existing_access_code>N</existing_access_code>
                <access_diversity>F</access_diversity>
                <access_path_avoidance>F</access_path_avoidance>
                <originating_jurisdiction_code>120033</originating_jurisdiction_code>
            </body>
            <body>
                <agency_service_request_number_2>GSAOID-41111789:41111789</agency_service_request_number_2>
                <package_id>7490b5b3-4da8-484e-8f95-c12cf3c2edb9</package_id>
                <body_id>41111789</body_id>
                <parent_body_id>41111787</parent_body_id>
                <agency_hierarchy_code>335288116ANYR2Q3DAQIEHHBGZ1P</agency_hierarchy_code>
                <contract_line_item_number>WL00020</contract_line_item_number>
                <clin_description>Pooling Overage for Data Add-on</clin_description>
                <order_item_type_code>I</order_item_type_code>
                <quantity>1</quantity>
                <fully_loaded_price_code>N</fully_loaded_price_code>
                <charging_frequency_and_sre_element_code>USAGE</charging_frequency_and_sre_element_code>
                <iconectiv_nsc>FTCLCOVS</iconectiv_nsc>
                <location_country>Domestic: CONUS</location_country>
                <street_number>2150</street_number>
                <street_name>Centre</street_name>
                <street_type>Ave</street_type>
                <location_city>Fort Collins</location_city>
                <location_state>CO</location_state>
                <location_postal_code>80526</location_postal_code>
                <location_latitude>40.558777</location_latitude>
                <location_longitude>-105.08703</location_longitude>
                <building>BULD B</building>
                <floor>FLR F</floor>
                <site_special_instructions>LOCATION NOTES</site_special_instructions>
                <existing_access_code>N</existing_access_code>
                <access_diversity>F</access_diversity>
                <access_path_avoidance>F</access_path_avoidance>
                <originating_jurisdiction_code>120033</originating_jurisdiction_code>
            </body>
            <footer/>
        </ns2:SORequest>
    </soap:Body>
</soap:Envelope>
